import React from "react"

import style from "./socialNetwork.module.css"

interface ISocialNetwork {
    id:number
}

const SocialNetwork: React.FC<ISocialNetwork> = ({id}) => {

    return (
        <div className={style.socialNetwork}>
            <ul className={style.socialNetwork__list}>
                <li className={[style.socialNetwork__item, style.email__item].join(' ')}>
                    <a className={style.socialNetwork__link} href={`mailto:enter@mail.com?subject=survey&body=Здравствуйте!%0D%0AПрошу пройти опрос по ссылке:%0D%0Ahttps://feedback.skroy.ru/survey/demo/${id}%0D%0AС уважением`} target={"_blank"} >
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd" d="M4 0C1.79086 0 0 1.79086 0 4V26C0 28.2091 1.79086 30 4 30H26C28.2091 30 30 28.2091 30 26V4C30 1.79086 28.2091 0 26 0H4ZM4.23908 8.38171C4.17353 8.32708 4.14896 8.23641 4.18488 8.15901C4.50251 7.47461 5.19583 7 6 7H24C24.8042 7 25.4975 7.47461 25.8151 8.15901C25.851 8.23641 25.8265 8.32708 25.7609 8.38171L15.3201 17.0824C15.1347 17.2369 14.8653 17.2369 14.6799 17.0824L4.23908 8.38171ZM25.672 9.75755C25.8022 9.649 26 9.74163 26 9.9112V21C26 22.1046 25.1046 23 24 23H6C4.89543 23 4 22.1046 4 21V9.9112C4 9.74163 4.19777 9.649 4.32804 9.75755L14.0397 17.8506C14.596 18.3142 15.404 18.3142 15.9603 17.8506L25.672 9.75755Z" />
                        </svg>
                    </a>
                </li>
                <li className={style.socialNetwork__item}>
                    <a href="https://www.linkedin.com/" className={style.socialNetwork__link}>
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd" d="M4 0C1.79086 0 0 1.79086 0 4V26C0 28.2091 1.79086 30 4 30H26C28.2091 30 30 28.2091 30 26V4C30 1.79086 28.2091 0 26 0H4ZM6.73363 9.31662C8.17095 9.31662 9.33612 8.15144 9.33612 6.71413C9.33612 5.27681 8.17095 4.11163 6.73363 4.11163C5.29631 4.11163 4.13114 5.27681 4.13114 6.71413C4.13114 8.15144 5.29631 9.31662 6.73363 9.31662ZM11.7196 11.2399H16.0327V13.2158C16.0327 13.2158 17.2032 10.875 20.3878 10.875C23.2286 10.875 25.5819 12.2744 25.5819 16.54V25.535H21.1122V17.63C21.1122 15.1137 19.7688 14.8369 18.7451 14.8369C16.6206 14.8369 16.2569 16.6694 16.2569 17.9582V25.535H11.7196V11.2399ZM9.00229 11.2399H4.46497V25.535H9.00229V11.2399Z" />
                        </svg>
                    </a>
                </li>
                <li className={style.socialNetwork__item}>
                    <a href="https://twitter.com/" className={style.socialNetwork__link}>
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd" d="M4 0C1.79086 0 0 1.79086 0 4V26C0 28.2091 1.79086 30 4 30H26C28.2091 30 30 28.2091 30 26V4C30 1.79086 28.2091 0 26 0H4ZM23.3365 11.9072C23.3365 11.7198 23.3341 11.5325 23.3268 11.3451C24.1028 10.7404 24.7747 9.98251 25.3084 9.12228C24.597 9.46296 23.8299 9.69275 23.0256 9.79495C23.8476 9.26689 24.4767 8.42387 24.7746 7.41885C24.0059 7.91284 23.1564 8.27054 22.2496 8.45791C21.5253 7.62323 20.4933 7.10361 19.3507 7.10361C17.156 7.10361 15.3771 9.02853 15.3771 11.4048C15.3771 11.737 15.4118 12.0691 15.4797 12.3842C12.1778 12.2053 9.24905 10.4934 7.29008 7.88712C6.94609 8.52591 6.75068 9.26693 6.75068 10.0505C6.75068 11.541 7.4524 12.8611 8.5199 13.6362C7.86825 13.6106 7.25457 13.4148 6.7184 13.0997V13.1509C6.7184 15.2376 8.08869 16.975 9.90797 17.3668C9.57205 17.469 9.2216 17.5201 8.86065 17.5201C8.60468 17.5201 8.35438 17.4944 8.11132 17.4433C8.61762 19.1468 10.0856 20.3988 11.8242 20.4243C10.4643 21.5827 8.75004 22.2727 6.88878 22.2727C6.56821 22.2727 6.25247 22.2471 5.94159 22.213C7.7003 23.431 9.78766 24.1464 12.0325 24.1464C19.3403 24.1464 23.3365 17.5881 23.3365 11.9072Z" />
                        </svg>
                    </a>
                </li>
                <li className={style.socialNetwork__item}>
                    <a href="https://www.facebook.com/" className={style.socialNetwork__link}>
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd" d="M4 0C1.79086 0 0 1.79086 0 4V26C0 28.2091 1.79086 30 4 30H26C28.2091 30 30 28.2091 30 26V4C30 1.79086 28.2091 0 26 0H4ZM21.5 15L20.8333 19.1667H17.5V30H12.5V19.1667H8.75V15H12.5V11.6667C12.5 7.91665 14.9167 5.83332 18.3333 5.83332C19.4167 5.83332 20.5833 5.99999 21.6667 6.16665V9.99999H19.75C17.9167 9.99999 17.5 10.9167 17.5 12.0833V15H21.5Z" />
                        </svg>
                    </a>
                </li>
            </ul>
        </div>
    )
}

export default React.memo(SocialNetwork)
